Планирование/src/Catalogs/ГруппыСезонности/ГруппыСезонности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыСезонности</name>
</mdclass:Catalog>

Планирование/src/InformationRegisters/КоэффициентыСезонности/КоэффициентыСезонности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентыСезонности</name>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>12</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГруппаСезонности</name>
    <type>
      <types>CatalogRef.ГруппыСезонности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Планирование/src/Catalogs/ГруппыСезонности/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗаписатьКоэффициентыИПоказатьГрафик(ГруппаСезонности, ИмяКоманды)
	
	Если ИмяКоманды = "ПоФактическимДанным" Тогда 
		Результат = ОбменДанными.ПолучитьДанныеСезонныхКоэффициентов(ГруппаСезонности);
	Иначе
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ГруппаСезонности", ГруппаСезонности);
		Результат = ОбменДанными.ПолучитьДанныеСезонныхКоэффициентовСкользящих(СтруктураПараметров);
		Если ИмяКоманды = "Сравнить" Тогда
			Результат2 = ОбменДанными.ПолучитьДанныеСезонныхКоэффициентов(ГруппаСезонности);
		КонецЕсли;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	График.Очистить();
	Если ИмяКоманды <> "ПоФактическимДанным" Тогда
		СерияИмя = "По Сглаженным Данным";
	Иначе
		СерияИмя = "По Фактическим Данным";
	КонецЕсли;
	
	Серия = График.УстановитьСерию(СерияИмя);
	Серия.Текст = СерияИмя;

	Пока Выборка.Следующий() Цикл
		Если ИмяКоманды <> "Сравнить" Тогда
			НаборЗаписей = РегистрыСведений.КоэффициентыСезонности.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ГруппаСезонности.Установить(ГруппаСезонности);
			НаборЗаписей.Отбор.Месяц.Установить(Выборка.Месяц);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			Запись = НаборЗаписей.Добавить();
			Запись.Месяц = Выборка.Месяц;
			Запись.ГруппаСезонности = ГруппаСезонности;
			Запись.Коэффициент = Выборка.Коэффициент;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		Месяц = число(формат(Выборка.Месяц,"ДФ=M"));
		тчк = СокрП(Сред("        январь  февраль март    апрель  май     июнь    июль    август  сентябрьоктябрь ноябрь  декабрь ",Месяц*8+1,3)) +
		формат(Выборка.Месяц,"ДФ=' yy'");
		Точка = График.УстановитьТочку(Выборка.Месяц);
		Точка.Текст = тчк;
		График.УстановитьЗначение(Точка, Серия, Выборка.Коэффициент);
	КонецЦикла;
	//Добавлю тренд
	ЛинияТренда = Серия.ЛинииТренда.Добавить();
	ЛинияТренда.ТипАппроксимации = ТипАппроксимацииЛинииТрендаДиаграммы.Линейный;
	ЛинияТренда.Маркер = ТипМаркераДиаграммы.Нет;
	ЛинияТренда.ОтображатьУравнение = Истина;
	ЛинияТренда.ОтображатьКоэффициентДетерминации = Истина;
	
	Если ИмяКоманды = "Сравнить" Тогда
		Выборка = Результат2.Выбрать();
		СерияИмя = "По Фактическим Данным";
		Серия = График.УстановитьСерию(СерияИмя);
		Серия.Текст = СерияИмя;
		
		Пока Выборка.Следующий() Цикл			
			Месяц = число(формат(Выборка.Месяц,"ДФ=M"));
			тчк = СокрП(Сред("        январь  февраль март    апрель  май     июнь    июль    август  сентябрьоктябрь ноябрь  декабрь ",Месяц*8+1,3)) +
			формат(Выборка.Месяц,"ДФ=' yy'");
			Точка = График.УстановитьТочку(Выборка.Месяц);
			Точка.Текст = тчк;
			График.УстановитьЗначение(Точка, Серия, Выборка.Коэффициент);
		КонецЦикла;
		//Добавлю тренд
		ЛинияТренда = Серия.ЛинииТренда.Добавить();
		ЛинияТренда.ТипАппроксимации = ТипАппроксимацииЛинииТрендаДиаграммы.Линейный;
		ЛинияТренда.Маркер = ТипМаркераДиаграммы.Нет;
		ЛинияТренда.ОтображатьУравнение = Истина;
		ЛинияТренда.ОтображатьКоэффициентДетерминации = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоГруппе(Команда)
	График.Обновление = Ложь;
	Если Элементы.Список.ВыделенныеСтроки.Количество() Тогда
		ЗаписатьКоэффициентыИПоказатьГрафик(Элементы.Список.ВыделенныеСтроки[0], Команда.Имя);
	КонецЕсли;
	График.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	График.Обновление = Ложь;
	График.Очистить();
	ПоказатьГрафик(Элемент.Текущиеданные.Наименование);
	График.Обновление = Истина;
КонецПроцедуры

&НаСервере
Процедура ПоказатьГрафик(ГруппаСезонностиНаименование)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентыСезонности.Месяц КАК Месяц,
		|	КоэффициентыСезонности.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.КоэффициентыСезонности КАК КоэффициентыСезонности
		|ГДЕ
		|	КоэффициентыСезонности.Месяц <= &ДатаОкончания
		|	И КоэффициентыСезонности.Месяц >= &ДатаНачала
		|	И КоэффициентыСезонности.ГруппаСезонности = &ГруппаСезонности
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц";
	
	ГруппаСезонности = Справочники.ГруппыСезонности.НайтиПоНаименованию(ГруппаСезонностиНаименование, Истина);
	Запрос.УстановитьПараметр("ГруппаСезонности", ГруппаСезонности);
	ПериодГрафика = Новый СтандартныйПериод;
	ПериодГрафика.Вариант = ВариантСтандартногоПериода.ПрошлыйГод;
	Запрос.УстановитьПараметр("ДатаНачала", ПериодГрафика.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодГрафика.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Серия = График.УстановитьСерию(ГруппаСезонности);
	
	Пока Выборка.Следующий() Цикл			
		Месяц = число(формат(Выборка.Месяц,"ДФ=M"));
		тчк = СокрП(Сред("        январь  февраль март    апрель  май     июнь    июль    август  сентябрьоктябрь ноябрь  декабрь ",Месяц*8+1,3)) +
		формат(Выборка.Месяц,"ДФ=' yy'");
		Точка = График.УстановитьТочку(Выборка.Месяц);
		Точка.Текст = тчк;
		График.УстановитьЗначение(Точка, Серия, Выборка.Коэффициент);
	КонецЦикла;
	ЛинияТренда = Серия.ЛинииТренда.Добавить();
	ЛинияТренда.ТипАппроксимации = ТипАппроксимацииЛинииТрендаДиаграммы.Линейный;
	ЛинияТренда.Маркер = ТипМаркераДиаграммы.Нет;
	ЛинияТренда.ОтображатьУравнение = Истина;
	ЛинияТренда.ОтображатьКоэффициентДетерминации = Истина;	
	//коэф = РассчитатьКоэффициенты(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Коэффициент"));
КонецПроцедуры
